In [1]:
# Import libraries
import pandas as pd
import numpy as np
import os

In [2]:
df_prods = pd.read_csv('/Users/yukbuinnemtat/Desktop/30-07-2023 Instacart Basket Analysis/02 Data/Original Data/products.csv')

In [3]:
df_ords = pd.read_csv('/Users/yukbuinnemtat/Desktop/30-07-2023 Instacart Basket Analysis/02 Data/Prepared Data/orders_wrangled.csv')

### 2. Run the df.describe() function on your df_ords dataframe. Using your new knowledge about how to interpret the output of this function, share in a markdown cell whether anything about the data looks off or should be investigated further.

#### Tip: Keep an eye on min and max values!

In [4]:
# To get an overview of the statistical summary of the dataframe.

df_ords.describe()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

### 3. Check for mixed-type data in your df_ords dataframe.

In [5]:
# To check the data types of each column.

df_ords.dtypes

order_id                    int64
user_id                     int64
order_number                int64
orders_day_of_week          int64
order_hour_of_day           int64
days_since_prior_order    float64
dtype: object

### Small test dataframe to show mix data types

In [6]:
# creates a new dataframe

df_test = pd.DataFrame()

In [7]:
# creates a mixed type column

df_test['mix'] = ['a', 'b', 1, True]

In [8]:
df_test.head

<bound method NDFrame.head of     mix
0     a
1     b
2     1
3  True>

In [9]:
# check for mixed types

for col in df_test.columns.tolist():
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)

mix

### 4. If you find mixed-type data, fix it. The column in question should contain observations of a single data type.

In [10]:
# converting mixed data type columns to a single data type.

df_test['mix'] = df_test['mix'].astype('str')

### 5. Address the missing values using an appropriate method:

In [11]:
# Checks any missing values

df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [12]:
df_ords.isnull().sum()

order_id                       0
user_id                        0
order_number                   0
orders_day_of_week             0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

In [13]:
# Since missing values are from the product name, imputation would be impossible here since they are strings.

df_prods.describe()

         product_id      aisle_id  department_id        prices
count  49693.000000  49693.000000   49693.000000  49693.000000
mean   24844.345139     67.770249      11.728433      9.994136
std    14343.717401     38.316774       5.850282    453.519686
min        1.000000      1.000000       1.000000      1.000000
25%    12423.000000     35.000000       7.000000      4.100000
50%    24845.000000     69.000000      13.000000      7.100000
75%    37265.000000    100.000000      17.000000     11.200000
max    49688.000000    134.000000      21.000000  99999.000000

In [14]:
# Defines a new dataframe df_nan for linear interpolation rather than imputation.

df_nan = df_prods[df_prods['product_name'].isnull() ==True]

In [15]:
# Shows subset of the dataframe containing only the 16 missing values from the product_name

df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [16]:
# To compare the number of rows in the current dataframe with the number in the subset once the missing rows have been removed.

df_prods.shape

(49693, 5)

In [17]:
# To remove missing values in the new dataframe.

df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]

In [18]:
# To check that the number of rows has decreased(Missing values have been removed).

df_prods_clean.shape

(49677, 5)

In [19]:
# creates a new subset containing only rows that are duplicates.

df_dups = df_prods_clean[df_prods_clean.duplicated()]

In [20]:
# Duplicates may be as a result of data entry error.

df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [21]:
df_dups.shape

(5, 5)

In [22]:
# To compare the number after removing the duplicates.

df_prods_clean.shape

(49677, 5)

In [23]:
# To look for full duplicates within the dataframe and drop them since it may have resulted from data entry error.

df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

In [24]:
# To check if there are fewer rows, if yes then that implies operation was successful.

df_prods_clean_no_dups.shape

(49672, 5)

### 6. Run a check for duplicate values in your df_ords data.

#### In a markdown cell, report your findings and propose an explanation for any duplicate values you find.

In [25]:
# To check for duplicate rows in the dataframe.

df_ords.duplicated().sum()

0

In [26]:
df_ords.shape

(3421083, 6)

### 7. Export your final, cleaned df_prods and df_ords data as “.csv” files in your “Prepared Data” folder and give them appropriate, succinct names.

In [66]:
df_ords.to_csv("Prepared Data/orders_checked.csv", index=False)

In [67]:
df_ords.to_csv("Prepared Data/products_checked.csv", index=False)